Synwit-Co-Ltd/SWM260_UserBoot/SWM260_APP/CSL/SWM260_StdPeriph_Driver/SWM260_uart.c
/****************************************************************************************************************************************** 
* 文件名称:	SWM260_uart.c
* 功能说明:	SWM260单片机的UART串口功能驱动库
* 技术支持:	http://www.synwit.com.cn/e/tool/gbook/?bid=1
* 注意事项: 没有编写LIN功能相关的函数
* 版本日期:	V1.0.0		2016年1月30日
* 升级记录: 
*
*
*******************************************************************************************************************************************
* @attention
*
* THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS WITH CODING INFORMATION 
* REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE TIME. AS A RESULT, SYNWIT SHALL NOT BE HELD LIABLE 
* FOR ANY DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING FROM THE CONTENT 
* OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE CODING INFORMATION CONTAINED HEREIN IN CONN-
* -ECTION WITH THEIR PRODUCTS.
*
* COPYRIGHT 2012 Synwit Technology 
*******************************************************************************************************************************************/
#include "SWM260.h"
#include "SWM260_uart.h"


/****************************************************************************************************************************************** 
* 函数名称:	UART_Init()
* 功能说明:	UART串口初始化
* 输    入: UART_TypeDef * UARTx	指定要被设置的UART串口，有效值包括UART0、UART1、UART2、UART3、UART4
*			UART_InitStructure * initStruct    包含UART串口相关设定值的结构体
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void UART_Init(UART_TypeDef * UARTx, UART_InitStructure * initStruct)
{	
	switch((uint32_t)UARTx)
	{
	case ((uint32_t)UART0):
		SYS->CLKEN0 |= (0x01 << SYS_CLKEN0_UART0_Pos);
		break;
	
	case ((uint32_t)UART1):
		SYS->CLKEN0 |= (0x01 << SYS_CLKEN0_UART1_Pos);
		break;
	
	case ((uint32_t)UART2):
		SYS->CLKEN0 |= (0x01 << SYS_CLKEN0_UART2_Pos);
		break;
	
	case ((uint32_t)UART3):
		SYS->CLKEN0 |= (0x01 << SYS_CLKEN0_UART3_Pos);
		break;
	
	case ((uint32_t)UART4):
		SYS->CLKEN1 |= (0x01 << SYS_CLKEN1_UART4_Pos);
		break;
	}
	
	UART_Close(UARTx);	//一些关键寄存器只能在串口关闭时设置
	
	UARTx->CTRL |= (0x01 << UART_CTRL_BAUDEN_Pos);
	UARTx->BAUD &= ~UART_BAUD_BAUD_Msk;
	if((UARTx == UART0) || (UARTx == UART1) || (UARTx == UART2) || (UARTx == UART3))
		UARTx->BAUD |= ((SystemCoreClock/16/initStruct->Baudrate - 1) << UART_BAUD_BAUD_Pos);
	else
		UARTx->BAUD |= (((SystemCoreClock/2)/16/initStruct->Baudrate - 1) << UART_BAUD_BAUD_Pos);
	
	UARTx->CTRL &= ~(UART_CTRL_DATA9b_Msk | UART_CTRL_PARITY_Msk | UART_CTRL_STOP2b_Msk);
	UARTx->CTRL |= (initStruct->DataBits << UART_CTRL_DATA9b_Pos) |
				   (initStruct->Parity   << UART_CTRL_PARITY_Pos) |
				   (initStruct->StopBits << UART_CTRL_STOP2b_Pos);
	
	UARTx->FIFO &= ~(UART_FIFO_RXTHR_Msk | UART_FIFO_TXTHR_Msk);
	UARTx->FIFO |= (initStruct->RXThreshold << UART_FIFO_RXTHR_Pos) | 
				   (initStruct->TXThreshold << UART_FIFO_TXTHR_Pos);
	
	UARTx->CTRL &= ~UART_CTRL_TOTIME_Msk;
	UARTx->CTRL |= (initStruct->TimeoutTime << UART_CTRL_TOTIME_Pos);
	
	UARTx->CTRL &= ~(UART_CTRL_RXIE_Msk | UART_CTRL_TXIE_Msk | UART_CTRL_TOIE_Msk);
	UARTx->CTRL |= (initStruct->RXThresholdIEn << UART_CTRL_RXIE_Pos) |
				   (initStruct->TXThresholdIEn << UART_CTRL_TXIE_Pos) |
				   (initStruct->TimeoutIEn << UART_CTRL_TOIE_Pos);
	
	switch((uint32_t)UARTx)
	{
	case ((uint32_t)UART0):		
		if(initStruct->RXThresholdIEn | initStruct->TXThresholdIEn | initStruct->TimeoutIEn)
		{
			NVIC_EnableIRQ(UART0_IRQn);
		}
		else
		{
			NVIC_DisableIRQ(UART0_IRQn);
		}
		break;
	
	case ((uint32_t)UART1):		
		if(initStruct->RXThresholdIEn | initStruct->TXThresholdIEn | initStruct->TimeoutIEn)
		{
			NVIC_EnableIRQ(UART1_IRQn);
		}
		else
		{
			NVIC_DisableIRQ(UART1_IRQn);
		}
		break;
	
	case ((uint32_t)UART2):		
		if(initStruct->RXThresholdIEn | initStruct->TXThresholdIEn | initStruct->TimeoutIEn)
		{
			NVIC_EnableIRQ(UART2_IRQn);
		}
		else
		{
			NVIC_DisableIRQ(UART2_IRQn);
		}
		break;
	
	case ((uint32_t)UART3):		
		if(initStruct->RXThresholdIEn | initStruct->TXThresholdIEn | initStruct->TimeoutIEn)
		{
			NVIC_EnableIRQ(UART3_IRQn);
		}
		else
		{
			NVIC_DisableIRQ(UART3_IRQn);
		}
		break;
	
	case ((uint32_t)UART4):		
		if(initStruct->RXThresholdIEn | initStruct->TXThresholdIEn | initStruct->TimeoutIEn)
		{
			NVIC_EnableIRQ(PWM2_UART4_IRQn);
		}
		else
		{
			NVIC_DisableIRQ(PWM2_UART4_IRQn);
		}
		break;
	}
}

/****************************************************************************************************************************************** 
* 函数名称:	UART_Open()
* 功能说明:	UART串口打开
* 输    入: UART_TypeDef * UARTx	指定要被设置的UART串口，有效值包括UART0、UART1、UART2、UART3、UART4
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void UART_Open(UART_TypeDef * UARTx)
{
	UARTx->CTRL |= (0x01 << UART_CTRL_EN_Pos);
}

/****************************************************************************************************************************************** 
* 函数名称:	UART_Close()
* 功能说明:	UART串口关闭
* 输    入: UART_TypeDef * UARTx	指定要被设置的UART串口，有效值包括UART0、UART1、UART2、UART3、UART4
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void UART_Close(UART_TypeDef * UARTx)
{
	UARTx->CTRL &= ~(0x01 << UART_CTRL_EN_Pos);
}

/****************************************************************************************************************************************** 
* 函数名称:	UART_WriteByte()
* 功能说明:	发送一个字节数据
* 输    入: UART_TypeDef * UARTx	指定要被设置的UART串口，可取值包括UART0、UART1、UART2、UART3、UART4、UART4
*			uint8_t data			要发送的字节			
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void UART_WriteByte(UART_TypeDef * UARTx, uint8_t data)
{
	UARTx->DATA = data;
}

/****************************************************************************************************************************************** 
* 函数名称:	UART_ReadByte()
* 功能说明:	读取一个字节数据，并指出数据是否Valid
* 输    入: UART_TypeDef * UARTx	指定要被设置的UART串口，可取值包括UART0、UART1、UART2、UART3、UART4、UART4
*			uint32_t * data			接收到的数据
* 输    出: uint32_t				0 无错误    UART_ERR_PARITY 奇偶校验错误
* 注意事项: 无
******************************************************************************************************************************************/
uint32_t UART_ReadByte(UART_TypeDef * UARTx, uint32_t * data)
{
	uint32_t reg = UARTx->DATA;
	
	*data = (reg & UART_DATA_DATA_Msk);
	
	if(reg & UART_DATA_PAERR_Msk) return UART_ERR_PARITY;
	
